# Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame. 
#### For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database in Step 1 below.

### 1. For your database, you should download and install the appropriate version of the Chinook database for your RDBMS, which is available here, under the downloads tab: https://chinookdatabase.codeplex.com/

In [10]:
import pandas as pd
import sqlite3

In [15]:
con = sqlite3.connect('Chinook_Sqlite.sqlite')
artist = pd.read_sql_query('SELECT * FROM artist', con=con)
con.close()
artist.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

### 2. Your task is to create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName.

In [16]:
sql = '''
    SELECT c.LastName, c.FirstName, t.Name, a.Title
    FROM Customer as c
    LEFT JOIN Invoice as i
    ON c.CustomerId = i.CustomerId
    LEFT JOIN InvoiceLine as il
    ON i.InvoiceId = il.InvoiceId
    LEFT JOIN Track as t
    ON il.TrackId = t.TrackId
    LEFT JOIN Album as a
    ON t.AlbumId = a.AlbumId
    ORDER BY c.LastName, c.FirstName
    '''

con = sqlite3.connect('Chinook_Sqlite.sqlite')
db = pd.read_sql_query(sql, con=con)
con.close()
db.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas